  <?php 
        include('header.php');
        include('navbar.php');
  ?>
  <main>
    <h3>แนวทางการทำวิจัย</h3>
    <p>
    งานวิจัยที่จะทำนี้ ทำเพื่อการจัดเก็บข้อมูลวัตถุที่นอกเหนือจากมนุษย์ในช่องทางข้ามทางม้าลายหน้าตลาด<br>
    ไม่ว่าจะเป็นรถเข็นส่งสินค้า รถจักรยานยนต์ ซึ่งสิ่งต่างๆ เหล่านี้ไม่ควรอยู่ในช่องทางข้าม<br>
    เนื่องจากช่องทางข้าม มีขนาดที่ไม่ได้กว้างเพียงพอเพื่อให้รถสัญจรผ่านไปได้<br>
    อาจทำให้เกิดอันตรายแก่ผู้ใช้ทางข้าม จนเป็นเหตุให้บาดเจ็บและเสียชีวิตได้<br><br>
    จึงทำให้เกิดงานวิจัยชิ้นนี้ขึ้นมา เพื่อทำการเก็บข้อมูลแล้วอาจนำข้อมูลเหล่านี้ไปพูดคุย<br>
    กับหน่วยงานราชการเพื่อแก้ไขปัญหาที่เกิดขึ้นได้<br><br>
    ในงานวิจัยนี้ได้นำเสนอระบบตรวจวัตถุด้วยวิธีการ YOLO ช่วยจัดเก็บข้อมูลเพื่อได้รู้ถึง<br>
    วัตถุที่นอกเหนือจากมนุษย์ในช่องทางข้ามทางม้าลายได้ โดยในการวิจัยจะทำการทดลอง<br>
    ตรวจจับภาพรถเข็นขนส่งสินค้า, รถจักรยายนต์ ที่มีอยู่ในประเทศไทยที่อยู่บนอินเทอร์เน็ต<br>
    และภาพถ่ายที่อาจหาไม่ได้จากอินเตอร์เน็ต เพื่อวัดค่าความถูกต้องของระบบ<br>
    </p>
    <img class="main-image" src="img/cctv.jpg" alt="Main Image">
    <!-- Your content for the About page goes here -->
  </main>
